/**
Если брать язык java, то самое простое в смысле модульности - это то, что классы лежат в своих файлах .java, и они отделены в этом смысле от других классов.
Также определённую модульность обеспечивают пакеты имён (package). В обычном смысле можно сформировать пакет и его уже напрямую импортировать в другой класс для использования.
Начиная с 9 версии java была введена модульная система.
Говоря же о механизмах повторного использования кода в java можно использовать наследование и имплементацию от интерфейсов.
В более глобальном смысле можно создавать свои "модули" посредством упаковки .jar файлов
*/
