1) Наследование подтипов (subtype inheritance)
Родительская категория естественно разделяется на достаточно очевидные и независимые подкатегории

Жанр музыки: рок, джаз, поп

2) Наследование с ограничением (restriction inheritance)
Родительский класс не расширяется новыми возможностями, а наоборот ограничивается  
  
Билет: пенсионный, студенческий, детский

3) Наследование с расширением (extension inheritance)
Расширение уже самого класса-предка новыми возможностями, никак не применимыми к объектам родительского класса

Возможно Пылесос - робот-пылесос
